//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "Screen4.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen4::Screen4() : AbstractTFTScreen("RTCSettings")
{
  
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen4::doSetup(TFTMenu* menu)
{
	int menu_height = 30;
	int button_gap = 20;
	screenButtons->setTextFont(SCREEN_BIG_FONT);
  // тут настраиваемся, например, можем добавлять кнопки
  screenButtons->addButton(MENU_X, menu_height, BUTTON_WIDTH, 45, "Уст.время");
  menu_height += BUTTON_HEIGHT + button_gap;
  screenButtons->addButton(MENU_X, menu_height, BUTTON_WIDTH, 45, "Уст.дату");
  menu_height += BUTTON_HEIGHT + button_gap;
  menu_height += BUTTON_HEIGHT + button_gap;
  menu_height += BUTTON_HEIGHT + button_gap;
 
  screenButtons->addButton(5, 270, BUTTON_WIDTH, 45, "ВЫХОД");  //5, 140, 165, 30
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen4::doUpdate(TFTMenu* menu)
{
    // тут обновляем внутреннее состояние
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen4::doDraw(TFTMenu* menu)
{
  UTFT* dc = menu->getDC();
  dc->setColor(VGA_MAROON);
  //dc->setBackColor(VGA_WHITE);
  dc->setBackColor(VGA_BLACK);
   // тут рисуем, что надо именно нам, кнопки прорисуются сами после того, как мы тут всё отрисуем
 // menu->print("Экран номер 2", 10, 0);
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen4::onButtonPressed(TFTMenu* menu, int pressedButton)
{
  // обработчик нажатия на кнопку. Номера кнопок начинаются с 0 и идут в том порядке, в котором мы их добавляли
 
  if (pressedButton == 0)
  {
	  menu->switchToScreen("DateSettings"); // переключаемся на 5 экран
  }
  else if (pressedButton == 1)
  {
	  menu->switchToScreen("TimeSettings"); // переключаемся на 6 экран
  }
  else if (pressedButton == 2)
  {
	  menu->switchToScreen("Main"); // переключаемся на экран настроек
  }
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

