#pragma once

#if (TARGET_BOARD != ESP32_BOARD)
  #error "Target board MUST BE ESP32_BOARD for this configuration!"
#endif

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки датчиков
//--------------------------------------------------------------------------------------------------------------------------------
#define SENSOR_PIN 25 // GPIO25, вход датчика

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки текста
//--------------------------------------------------------------------------------------------------------------------------------
#define WM_BACK_CAPTION "< НАЗАД"
#define WM_SAVE_CAPTION "СОХРАНИТЬ"
#define START_CAPTION "ПУСК"
#define MENU_CAPTION "СЕРВИСНОЕ МЕНЮ"


//--------------------------------------------------------------------------------------------------------------------------------
// экраны
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TFT_MODULE // закомментировать, если не нужна поддержка TFT

//--------------------------------------------------------------------------------------------------------------------------------
// настройки Serial
//--------------------------------------------------------------------------------------------------------------------------------
#define SERIAL_BAUD_RATE 115200 // скорость работы с портами, бод (конфигуратор работает с портом именно на скорости 57600)

//--------------------------------------------------------------------------------------------------------------------------------
// настройки TFT (используется экран с разрешением 800x480)
//--------------------------------------------------------------------------------------------------------------------------------
// цвета для TFT
//--------------------------------------------------------------------------------------------------------------------------------
#define TFT_BACK_COLOR TFT_WHITE // цвет фона
#define TFT_BUTTON_COLORS TFT_WHITE, 0x8410, WHITE, 0xF800, 0x001F
#define TFT_FONT_COLOR 0x4A69 // цвет шрифта по умолчанию
#define TFT_CHANNELS_BUTTON_COLORS 0x3A8D, 0xC618, 0x8410, 0xF800, 0xEF7D // цвета кнопок для каналов
#define INFO_BOX_BACK_COLOR 0x6161 // цвет фона для информационного бокса
#define INFO_BOX_BORDER_COLOR TFT_BLACK // цвет рамки информационного бокса
#define INFO_BOX_CAPTION_COLOR 0x33D6 // цвет заголовка информационного бокса
#define SENSOR_BOX_FONT_COLOR TFT_WHITE // цвет показаний датчика
#define SENSOR_BOX_UNIT_COLOR TFT_WHITE // цвет единиц изменений датчика
#define MODE_ON_COLOR 0x0400   // цвет "вкл", "авто"
#define MODE_OFF_COLOR 0x8000 // цвет "выкл", "ручной"
#define CHANNELS_BUTTONS_TEXT_COLOR TFT_WHITE // цвет текста кнопок каналов
#define CHANNELS_BUTTONS_BG_COLOR 0xEF7D    // цвет фона кнопок каналов
#define CHANNEL_BUTTONS_TEXT_COLOR 0x3A8D   // цвет текста кнопки одного канала
#define TIME_PART_FONT_COLOR 0x0410 // цвет текста кнопки установки компонента времени
#define TIME_PART_SELECTED_FONT_COLOR TFT_WHITE // цвет текста активной кнопки компонента времени
#define TIME_PART_BG_COLOR 0xEF7D // цвет фона кнопки компонента времени
#define TIME_PART_SELECTED_BG_COLOR 0x0400 // цвет фона выбранной кнопки компонента времени
#define STATUS_ON_COLOR 0x07E0 // цвет статусов на экране ожидания
//--------------------------------------------------------------------------------------------------------------------------------

